English/NCE2/L70 Red for danger.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>

* Lesson 70 Red for danger
#+begin_verse
How was the drunk removed from the ring?

During a bullfight, a drunk suddenly wandered into the middle of the ring.
The crowd began to shout, but the drunk *was unaware of* the danger.
The bull *was busy with the matador* *at the time*,
	but it suddenly *caught sight of* the drunk who was shouting rude remarks and waving a red cap.
Apparently *sensitive to* criticism,
	the bull forgot all about the matador and *charged at* the drunk.
The crowd suddenly *grew quiet*.
The drunk, however, seemed quite sure of himself.
When the bull *got close to him*, he clumsily *stepped aside* to let it pass.
The crowd *broke into cheers* and the drunk bowed.
By this time, however,
	three men had come into the ring and they quickly dragged the drunk to safety.
Even the bull seemed to *feel sorry for him*,
	for it *looked on* sympathetically
		until the drunk was *out of the way* before *once more* *turning its attention to the matador*.
#+end_verse
** expression
bullfight [ˈbʊlˌfaɪt] n.斗牛 ring n.园形竞技场地
drunk [drʌŋk] n.醉汉
wander [ˈwɑndər] v.溜达,乱走
unaware [ˌʌnəˈwer] adj.不知道的,未察觉的
bull [bʊl] n.公牛 matador [ˈmætədɔr] n.斗牛士
remark [rɪˈmɑrk] n.v.评论;言语 make that stupid remark
apparently [əˈperəntli] adv.明显地
sensitive [ˈsensətɪv] adj.敏感的
criticism [ˈkrɪtɪˌsɪzəm] n.批评
charge [tʃɑrdʒ] v.冲上去
clumsily ['klʌmzɪli] adv.笨拙地
bow [baʊ] v.鞠躬
safety [ˈseɪfti] n.安全地带
sympathetically [ˌsɪmpə'θetɪklɪ] adv.同情地

be unaware of … 未意识到
be aware/conscious of … 意识到……
make that stupid remark 说那种愚蠢的话
be sensitive about sth. 对某事敏感
accept criticism 接受批评
charge at sb. = attack 向某人冲去
for your safety 为了您的安全
--------------------

be busy with sth. 忙于某事
at the time 在当时
catch sight of a. 看到…
grow quiet... 变得宁静
get close to a. 接近A
step aside 让开;走到一旁
break into cheers 爆发出欢呼声
feel sorry for sb. 为某人感到难过;同情某人
look on ... 旁观
out of the way … 不挡道
turn sb’s attention to a. 把某人的注意力转移到…
once more 再一次



** DONE 单词造句
CLOSED: [2023-08-28 Mon 23:11]
bullfight n. ring n.
- I never enjoy seen bullfights.
- The boy shouldn't have insisted on seeing bullfights.
- During the bullfight, we must avoid throwing all kinds of things into the ring.
- I have never seen a bullfight, have you?
- Would you mind my seeing the bullfight on TV?
drunk n.
- The drunk said: "Fancy meeting your here."
- The drunk waved clumsily to us to take a lift.
- The drunk is proud of the captain.
- He refused to give the drunk a lift.
- The drunk reminded me of my father in my childhood.
wander v.
- You shouldn't have wandered alone here at night.
- If you were with me, I wouldn't wander alone.
- After having been hurt her legs, she has trouble wandering alone.
- She wandered alone in the street and excepted herself to be found.
- After have been robbed, I regretted wandering alone yesterday night.
unaware adj. be unaware/aware of …
- She was unaware of breaking the world record.
- She is quite aware of setting up a new world record.
- Unaware of the drunk, she continue to drive ahead.
- Aware of his helplessness, he began to acquire a good knowledge of the real world.
- Unless she is aware of the importance of study, she won't work hard.
bull n. matador n.
- The bull was staring at the matador all morning.
- The matador should have killed that bull during bullfight.
- During bullfight, the matador ran into serious trouble.
- It takes the matador seventy minutes to deal with the situation.
- The matador was fairly confident that the bull had been killed in the ring.
remark n.v. make that stupid remark
- Stop making that kind of stupid remark.
- I could bear that she is always making that stupid remark.
- It is no use pretending that the matador hasn't made that stupid remark.
- If you hadn't made that stupid remark, we would have been friend.
- The boy who made that stupid remark wasn't aware of danger.
apparently adv.
- Apparently, I have passed the driving test.
- Apparently, my dreams come true at Christmas.
- Apparently, the knife was used to cut fruits.
- Apparently, the cat has just made that sound.
- Apparently, I haven't made that stupid remark.
sensitive adj. be sensitive about sth.
- The student is sensitive about criticism.
- You're the only sensitive student who always accepts teachers' criticism.
- I really admire he for answering sensitive questions.
- The sensitive actor has a sence of humor.
- The matador who always succeed in killing bulls in the ring is sensitive about his failure.
criticism n. accept criticism
- You should have accepted criticism.
- After having accepted criticism, we put forward the plan.
- It's possible to improve your knowledge by accepting criticism.
- Aware of criticism, a colony of bees charge at him.
- It's usually worth accepting criticism.
charge v. charge at sb.=attack
- She charged at the boy, even though she noticed that he is not guilty.
- A short while ago, the bull has charged at the matador.
- To make matters worse, the enemy is charging at us now.
- After having found out who plays joke on her, she charged at the guy.
- The matador has trained the bull to charge at customer for a long time.
clumsily adv.
- In the future, I would grow old and react clumsily.
- After have been arrested for 10 hours, he smoked clumsily.
- The bird fly clumsily, we can get it under control.
- Though he did homework clumsily, he managed to finish it in time.
bow v.
- He insisted on Leo's bowing.
- Leo refused to bow.
- "I should have bowed just now", Leo said in a mournful voice.
- Leo agreed to bow.
- She sets off to bow everyone in the ring.
safety n. for your safety
- Don't wander alone at midnight for your safety.
- Please avoid talking to anyone about this. It's for your safety.
- The police dragged the druck to the safety in the concert hall.
- Don't throw anything into the ring for your safety.
- Let's us suppose that someone would lead to the safety.
sympathetically adv.
- It's no use pretending that you nodded your head sympathetically.
- They not only listen sympathetically, they do her a favor as well.
- They not only listen sympathetically, they give a charity performance as well.
- They not only listen sympathetically, they build a bridge in the village as well.
- I do try to listen to students sympathetically, but I couldn't do that all the time.
** DONE 反复听电影片段
CLOSED: [2023-08-29 Tue 20:15]
** DONE 习惯用法造句
CLOSED: [2023-08-29 Tue 13:51]
- be busy with sth.
	- I was busy with my own work.
	- After having found I was busy with my work, he insisted on my bowing.
	- Vivian, my close friend, was just busy with her dinner.
	- Why am I always busy with my housework.
	- If you were busy with your housework, you wouldn't take it easy.
- at the time
	- At the time, I admired him for breaking the world record.
	- At the time, I was as strong as a horse.
	- At the time, I trained my dog to press the brake pedal.
	- At the time, I saw him waving to me.
	- At the time, I was wondering how to acquire a good knowledge of English.
- catch sight of a.
	- If a bull caught sight of something red, he would charge at it.
	- If the bull hadn't caught sight of your red cap, he wouldn't have charged at you.
	- At the time, I caught sight of a beauty who gave a fright.
	- After having caught sight of my boss, I began to work hard.
	- catching sight of the thief, he rushed out of the shop.
- grow quiet...
	- The crowd gathered round and grew quiet.
	- It's difficult to make a large crowd of women grow quiet.
	- A large crowd of women grew quiet, after having been instructed to do housework.
	- If you haven't complained of, she wouldn't have grew quiet.
	- You shouldn't grow quiet on that occasion.
- get close to a.
	- The bull has got close to the drunk.
	- A large crowd of the women get close to the beggar.
	- In spite of this, she gets close to the pigeon.
	- The bull got close the matador in a few minutes.
	- I have trouble in getting close to nature.
- step aside
	- He just stepped aside to let the bull pass.
	- You needn't have stepped aside.
	- You need to know why you should step aside.
	- I saw the boss step aside.
	- I'm fairly certain that he has stepped aside.
- break into cheers
	- There is nobody hurted in the flood, everyone broke into cheers.
	- The drunk succeed in avoiding been charged by the bull, the crowd broke into cheers.
	- Having been told the news that China won a prize for the competition, everyone broke into cheers.
	- The child had no sooner set up the world record than his mother breaks into cheers.
	- You should have broken into cheers when your son managed to escape.
- feel sorry for sb.
	- She insisted on going abroad alone, and I really felt sorry for her husband.
	- The poor girl was arrested yesterday, and I felt sorry for her.
	- Ross made a big mistake at work. I felt sorry for him.
	- Ross is on break again, but I didn't feel sorry for him once more.
	- The king had his head cut, and I feel sorry for him.
- look on ...
	- A crowd of girl looked on in the concert hall as the Greenwood Boys was giving a performance.
	- You needn't have looked on and let it pass.
	- You should have looked on, it's none of your business.
	- If we began to look on, we would grow quiet.
	- After stepping aside, he looked on and let it pass.
- out of the way …
	- Get out of the way, now!
	- Would you mind my moving the chair out of the way?
	- He threatened to move the cat out of the way.
	- The bull looked on him until he was out of the way.
	- I got very angry, the rude boy asked me to get out of the way.
- turn sb’s attention to a.
	- I am always instructed to turn my attention to Mr. Leo.
	- If you turn your attention to me right now, I'll give me a lift.
	- If you turn your attention to me right now, I'll give you a fright.
	- If you turn your attention to me right now, I'll give you 10 pence.
	- If you turned your attention to Mr. Leo, you would pass the exam.
- once more
	- I'd like to pay my close friend a visit before I go abroad alone.
	- Mr. Leo met me and followed me around once more.
	- Repeat it once more.
	- She forbad her child to chase once more.
	- After having failed to lose weight, she went on a diet once more.
** DONE 跟读至背诵
CLOSED: [2023-08-29 Tue 13:51]
** DONE Ask me if 写+读
CLOSED: [2023-08-29 Tue 20:38]
1. A drunk was at a bullfight.(Who)
	 Who was at a bullfight?
2. He suddenly wandered into the middle of the ring.(Where )Who)
		Where did he suddenly wander?
		Who suddenly wandered into the middle of the ring?
3. The crowd began to shout.(Who)
		Who began to shout?
4. The drunk was unaware of the danger.(What)(Why)Who)
		What was the drunk unaware of?
		Why was the drunk unaware of the danger?
		Who was unaware of the danger?
5. The bull was busy with the matador.(Who)
		Who was the bull busy with?
6. The drunk shouted rude remarks.(What)
	 What did the drunk shout?
7. He waved a red cap.(What)(Who)
	 What did he wave?
	 Who waved a red cap?
8. The bull suddenly caught sight of him.(Who)(When)
	 Who did the bull suddenly catch sight of?
	 When did the bull catch sight of him?
9. It seemed to be sensitive to criticism.(What...do)
	 What did it seem to do?
10. It forgot about the matador.(Who)
		Who forgot about the matador?

** DONE 摘要写作
CLOSED: [2023-08-29 Tue 20:32]
A drunk suddenly wandered into the middle of the ring during a bullfight
	and shouted rude remarks and waved a red cap.
Ignoring the matador, the bull charged at him, but he stepped aside to let it pass.
The crowd cheered, and the drunk bowed.
Just after this, three men dragged the drunk to safety
	while the bull looked on sympathetically
		before it once more turned its attention to the matador.
** DONE tell the story 口语
CLOSED: [2023-08-29 Tue 20:37]
** Topics for discussion
- Some people think that bullfighting and other blood sports,
		such as cockfighting, hunting, etc.are cruel.
	 How would you(adefend them(b) criticize them?
- What do you consider the mostdangerous sport?
	 Why do you think people enjoy (a)taking part in and,(b)watching such a sport?
